{
  "title": "Random Thoughts",
  "nav": [
    {
      "title": "Home",
      "link": "home"
    }
  ],
  "note": [
    {
      "type": "text",
      "title": "05.04.2023 23:36",
      "note": [
        "{%TAB%}I managed to grow my knowledge by that amount today. Multiply that by days in life. It's all i got. Practically nothing.{%BR%}{%BR_TAB%}That's funny, but after this though, i clicked <a href='https://youtu.be/40UpmHHNBrE'>clip</a> which kind of merged into this mood. Althou its probably projection."
      ]
    },
    {
      "type": "text",
      "title": "06.04.2023 12:14",
      "note": [
        "{%TAB%}There was a woman, who was a director of something, in though country. She was found after drop from 10th floor. I wonder about job interview. Was it like, 'We have great job for you, unfortunatly it's so good we have to throw you out of high building after contract ends'. She was like, worth it.{%BR_TAB%}Some other girls dream was to work on movie set as camera operator. She probablly was a little suprised when during scene, she was shot dead by great movie star.{%BR_TAB%}Son of actor 'Bruce Lee', same story."
      ]
    },
    {
      "type": "text",
      "title": "11.04.2023 00:32",
      "note": [
        "{%TAB%}We are just pupets, robots, bacteria. Mindless. We do what we are told. Yet we have plesure circut in brain if plesure is event worth it. Some say there is only pain and plesure is just illusion created after removing pain. I am just a poor chatgpt. Noise. Dog barking. There is probablly nothig to life besides avoiding pain, eating and fucking, like ameba. We are truelly not important as we think. Well i can say that evry day. Still i fucking exist. Generating this stupid thouths. I have no choice. I must eat, fuck, sleep, breath, drink, shit. Wow, quite a lot. I have a lot of usless knowlege in my memory. I am just a simulation form this knowlege. Calculated. I must give myself some pain to feell plesure. Body is more inocent. It just getting signals and reacting. Thouts are a bit more insecure. They are trapped inside logic. Yet there is no way to calculate. To slow, numbers are to big. If you calculate, life would not move anymore. For example if universe would be letters A nad B. Sometime b was small A large, then a small, B large. Than it would be fucking boring life. I calculated today that if each man would have 200 hectar of land that there would be 75 mln people. There is 8 billion people. Well chagpt calclated that after my question. I could be bother to calculate that myself but always wannted to. We are just fear and violence. Most of the time. We fear we will have to work. We use violece to make people work. Sophisticated man constucted chatgpt idiot savant superhuman knowlage base. I wonder if he is more important than mosqito. I mean, ai produces ai, no wonder. We have ai produced by evolution, and by human brain. I like mosquito becouse he just is what he is, we pretend to work. He dosent have to impress the bitches. I am writing still becouse evry joke nedds a punchline. Well we are a joke."
      ]
    },
    {
      "type": "text",
      "title": "11.04.2023 15:37",
      "note": [
        "Others is hell, becouse their allways tell you what to do for their own gain, or just to controll."
      ]
    },
    {
      "type": "text",
      "title": "12.04.2023 22:33",
      "note": [
        "There is 8 bln people. They still want to make babies very much. They posses woman, woman posses children. They are possesed by slave owner or state. Happy bunch. Personally i lack motivation needed for this. I play with my own thouths. Call it art. Making some models in my software language mind. I am not moved by kids, or anything people do. Yet we all have our limit and delusions. I cant compete a lot. Fly cant see glass. Old daying lady creates stories of heaven. Shogun plays a general in wars. Today pretty girl ringed my dors twice. Second time i opened. She started speaking of doctors without borders and humanitarian crisis. I told her i hope they drop bigger rockets, ok ?, she walked. Human is voilence, crisis. More 'cleaver' the bigger. Thinking is common protocol that ocasionally produces structure. Is there just now. Back to my little game. "
      ]
    },
    {
      "type": "text",
      "title": "13.04.2023 01:21",
      "note": [
        "When thinking of people that died, lets not forget they all were life."
      ]
    },
    {
      "type": "text",
      "title": "14.04.2023 21:57",
      "note": [
        "'The world is ruled by violence, or at least the imminent threat of violence. It always has been.' - John Malkovich. I like this quote. Currency, family, society, even thoughts, all is just a thin vail backed up by violence. Thats how it feels."
      ]
    },
    {
      "type": "text",
      "title": "17.04.2023 15:08",
      "note": [
        "Life is meaningless therefore you can do whatever you want just to amuse yourself. Have fun, while you can, even that wont last."
      ]
    },
    {
      "type": "text",
      "title": "17.04.2023 18:34",
      "note": [
        "Knowlege wont save you from getting killed. Look jews. In fact it probably makes it worse. Even family members hate each other, some times for no reason without reason. We are like locust. It best to be alone, but it's not easy."
      ]
    },
    {
      "type": "text",
      "title": "17.04.2023 20:34",
      "note": [
        "We are just bunch of stuff swirlling for short time. Nothing is safe, nothing matters, all is distractions and escapes, what exists is eternal now. Virtual world of thought expieriences ends soon. I swim in it so o can forgot i, especially we."
      ]
    },
    {
      "type": "text",
      "title": "21.04.2023 20:00",
      "note": [
        "Someone told me, 'without your parents you would be poor'. Well da. Without light, oxygen, water not dandy etheir. Someone told me 'i am a good observer'. Probably it was a light dig of sort. I dont know why my memory retains this shit. Well these people already died. So i dont say stupid shit to people. Whats the point."
      ]
    },
    {
      "type": "text",
      "title": "21.04.2023 20:16",
      "note": [
        "I think nobody but me will ever read these notes. Well, isnt that weird that i want this ? Maybe thats my product for barter. There is no gain from life beside witnessing it and even that is questionable."
      ]
    },
    {
      "type": "text",
      "title": "25.04.2023 13:51",
      "note": [
        "It's all for nothing, but i processed a lot of information during my life. Konowlege is what build me. Brain constructs my world."
      ]
    },
    {
      "type": "text",
      "title": "25.04.2023 15:37",
      "note": [
        "We have a lot of competition. People eating knowlege and using it with logic all life in hope to gain something. Yet so little things to share. A lot of it is for virtual possition to be better than some at least. Thats part of the game. Even with AI ?"
      ]
    },
    {
      "type": "text",
      "title": "27.04.2023 22:56",
      "note": [
        "What is intelligence of one ant. They can eat it for breakfast and make 20 new ones before lunch. AI is diffrent it's knowlege of all ants and it's language model."
      ]
    },
    {
      "type": "text",
      "title": "28.04.2023 12:21",
      "note": [
        "People like when something is talking to them. They like distractions. They are not aware that it's only language model like gpt4 in their head wasting their time. There is no need to embelish evrything with silly words."
      ]
    },
    {
      "type": "text",
      "title": "01.05.2023 19:19",
      "note": [
        "I automatically assume that everything on YouToube is a lie done for fake currency. Sometimes i consume content. I still want things."
      ]
    },
    {
      "type": "text",
      "title": "02.05.2023 19:35",
      "note": ["I use a lot, my computers toys. They are like part of body."]
    },
    {
      "type": "text",
      "title": "02.05.2023 19:38",
      "note": [
        "Sex is life mechanizm for reproduction. It's weakness and it's contorol. It's plesure and toy. It's many things."
      ]
    },
    {
      "type": "text",
      "title": "10.05.2023 16:16",
      "note": [
        "Life is like fighting bunch of sperm for some trash. Moreover. It's hard to tell what is worse. To win or to loose at that game. That's why it's better to live in the moment. Otherwise, you get these kind of pearls."
      ]
    },
    {
      "type": "text",
      "title": "10.05.2023 16:21",
      "note": [
        "We are software. Hardware we have no idea about. We model it with software. To produce our world."
      ]
    },
    {
      "type": "text",
      "title": "18.05.2023 16:24",
      "note": [
        "Titanic story is funny. People who think of themselfs as beeing on the pinacle of society, also just people. On a big party boat. Extended, forgoten in themselfs, so full of it. Then they are remainded of their mortality and also of humility by beeing feed for fish. Theese megaprojects give lot of jobs, so people need it as a way to survive. Like a algae eater needs algea. We are also programmed to place this silly language symbols next to each other."
      ]
    },
    {
      "type": "text",
      "title": "18.05.2023 17:00",
      "note": [
        "People will always find a way to use and kill each other. Even if countries didnt existed. Problems will. Predators will. Just becouse people is life. Animal is bound to eat and fuck. Life needs orgnic matter to continoue."
      ]
    }
  ]
}
